app/Models/ModelPenjualan.php

SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan` = `tbl_produk`.`id_satuan`
WHERE `kode_produk` = '222'
---
    public function CekProduk($kode_produk){
        return $this->db->table('tbl_produk')
        ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_produk.id_kategori')
        ->join('tbl_satuan', 'tbl_satuan.id_satuan = tbl_produk.id_satuan')
        ->where('kode_produk', $kode_produk)
        ->get()
        ->getRowArray();

SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan` = `tbl_produk`.`id_satuan`
---
    public function AllProduk(){
        return $this->db->table('tbl_produk')
        ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_produk.id_kategori')
        ->join('tbl_satuan', 'tbl_satuan.id_satuan = tbl_produk.id_satuan')
        ->get()
        ->getResultArray();

INSERT INTO `tbl_jual` (`no_faktur`, `nama_konsumen`, `no_hp`, `tanggal_masuk`, `tanggal_selesai`, `deskripsi`, `gambar_before`, `tgl_jual`, `jam`, `grand_total`, `dibayar`, `kembalian`, `id_user`, `status_pembayaran`) VALUES ('6543', 'Galuh', '6287711652176', '2025-04-20', '2025-04-23', 'Adidas suede full white, strip black', 'uploads/before/1745135998_6f6c8cd30f4712836996.jpg', '2025-04-20', '14:59:58', 125000, '125000', '0', '1', 'success')
---
    public function InsertJual($data){
        $this->db->table('tbl_jual')->insert($data);

INSERT INTO `tbl_rinci_jual` (`no_faktur`, `nama_konsumen`, `no_hp`, `tanggal_masuk`, `tanggal_selesai`, `deskripsi`, `kode_produk`, `harga`, `modal`, `qty`, `total_harga`, `untung`) VALUES ('6543', 'Galuh', '6287711652176', '2025-04-20', '2025-04-23', 'Adidas suede full white, strip black', '111', 125000, '100000', 1, 125000, 25000)
---
    public function InsertRinciJual($data){
        $this->db->table('tbl_rinci_jual')->insert($data);