app/Models/ModelUser.php

    public function loginUser($email, $password){
        return $this->db->table('tbl_user')
        ->where([
            'email' => $email,
            'password' => $password,
            'status' => '1'
            ])
        ->get()
        ->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `email` = 'admin@gmail.com'
AND `password` = 'f865b53623b121fd34ee5426c792e5c33af8c227'
AND `status` = '1'