app/Models/ModelAdmin.php

SELECT `no_faktur`, `tgl_jual`, `grand_total`, `status_pembayaran`
FROM `tbl_jual`
ORDER BY `tgl_jual` DESC
 LIMIT 5
---
    public function GetPesananTerbaru() {
        return $this->db->table('tbl_jual')
                        ->select('no_faktur, tgl_jual, grand_total, status_pembayaran')
                        ->orderBy('tgl_jual', 'DESC')
                        ->limit(5) // Batasi jumlah pesanan terbaru
                        ->get()
                        ->getResultArray();