app/Models/ModelAdmin.php

    public function DetailData()
    {
        return $this->db->table('tbl_setting')
            ->where('id', 1)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `tbl_setting`
WHERE `id` = 1

    public function Grafik()
    {
        return $this->db->table('tbl_rinci_jual')
            ->join('tbl_jual', 'tbl_jual.no_faktur = tbl_rinci_jual.no_faktur')
            ->where('month(tbl_jual.tgl_jual)', date('m'))
            ->where('year(tbl_jual.tgl_jual)', date('Y'))
            ->select('tbl_jual.tgl_jual')
            ->groupBy('tbl_jual.tgl_jual')
            ->selectSum('tbl_rinci_jual.total_harga')
            ->selectSum('tbl_rinci_jual.untung')
            ->get()
            ->getResultArray();
---
SELECT `tbl_jual`.`tgl_jual`, SUM(`tbl_rinci_jual`.`total_harga`) AS `total_harga`, SUM(`tbl_rinci_jual`.`untung`) AS `untung`
FROM `tbl_rinci_jual`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur` = `tbl_rinci_jual`.`no_faktur`
WHERE month(tbl_jual.tgl_jual) = '04'
AND year(tbl_jual.tgl_jual) = '2025'
GROUP BY `tbl_jual`.`tgl_jual`

    public function PendapatanHariIni()
    {
        return $this->db->table('tbl_rinci_jual')
            ->join('tbl_jual', 'tbl_jual.no_faktur = tbl_rinci_jual.no_faktur')
            ->where('tbl_jual.tgl_jual', date('Y-m-d'))
            ->groupBy('tbl_jual.tgl_jual')
            ->selectSum('tbl_rinci_jual.total_harga')
            ->get()
            ->getRowArray();
---
SELECT SUM(`tbl_rinci_jual`.`total_harga`) AS `total_harga`
FROM `tbl_rinci_jual`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur` = `tbl_rinci_jual`.`no_faktur`
WHERE `tbl_jual`.`tgl_jual` = '2025-04-14'
GROUP BY `tbl_jual`.`tgl_jual`

    public function PendapatanBulanIni()
    {
        return $this->db->table('tbl_rinci_jual')
            ->join('tbl_jual', 'tbl_jual.no_faktur = tbl_rinci_jual.no_faktur')
            ->where('month(tbl_jual.tgl_jual)', date('m'))
            ->where('year(tbl_jual.tgl_jual)', date('Y'))
            ->groupBy('month(tbl_jual.tgl_jual)')
            ->selectSum('tbl_rinci_jual.total_harga')
            ->get()
            ->getRowArray();
---
SELECT SUM(`tbl_rinci_jual`.`total_harga`) AS `total_harga`
FROM `tbl_rinci_jual`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur` = `tbl_rinci_jual`.`no_faktur`
WHERE month(tbl_jual.tgl_jual) = '04'
AND year(tbl_jual.tgl_jual) = '2025'
GROUP BY month(tbl_jual.tgl_jual)

    public function PendapatanTahunIni()
    {
        return $this->db->table('tbl_rinci_jual')
            ->join('tbl_jual', 'tbl_jual.no_faktur = tbl_rinci_jual.no_faktur')
            ->where('year(tbl_jual.tgl_jual)', date('Y'))
            ->groupBy('year(tbl_jual.tgl_jual)')
            ->selectSum('tbl_rinci_jual.total_harga')
            ->get()
            ->getRowArray();
---
SELECT SUM(`tbl_rinci_jual`.`total_harga`) AS `total_harga`
FROM `tbl_rinci_jual`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur` = `tbl_rinci_jual`.`no_faktur`
WHERE year(tbl_jual.tgl_jual) = '2025'
GROUP BY year(tbl_jual.tgl_jual)

    public function JumlahProduk()
    {
        return $this->db->table('tbl_produk')
            ->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_produk`

    public function JumlahKategori()
    {
        return $this->db->table('tbl_kategori')
            ->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_kategori`

    public function JumlahSatuan()
    {
        return $this->db->table('tbl_satuan')
            ->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_satuan`

    public function JumlahUser()
    {
        return $this->db->table('tbl_user')
            ->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_user`

    public function LatestOrder()
    {
        return $this->db->table('tbl_rinci_jual')
            ->join('tbl_jual', 'tbl_rinci_jual.no_faktur = tbl_jual.no_faktur')
            ->orderBy('tbl_jual.jam', 'DESC') // Urutkan berdasarkan tanggal & jam terbaru
            ->limit(5) // Batasi jumlah pesanan yang diambil, misalnya 5 pesanan terakhir
            ->select('tbl_jual.no_faktur, tbl_jual.jam, tbl_rinci_jual.kode_produk,
                     tbl_rinci_jual.qty, tbl_rinci_jual.harga, tbl_rinci_jual.total_harga,
                     tbl_rinci_jual.untung')
            ->get()->getResultArray();
---
SELECT `tbl_jual`.`no_faktur`, `tbl_jual`.`jam`, `tbl_rinci_jual`.`kode_produk`, `tbl_rinci_jual`.`qty`, `tbl_rinci_jual`.`harga`, `tbl_rinci_jual`.`total_harga`, `tbl_rinci_jual`.`untung`
FROM `tbl_rinci_jual`
JOIN `tbl_jual` ON `tbl_rinci_jual`.`no_faktur` = `tbl_jual`.`no_faktur`
ORDER BY `tbl_jual`.`jam` DESC
 LIMIT 5

    public function GetPesananTerbaru()
    {
        return $this->db->table('tbl_jual')
            ->select('no_faktur, tgl_jual, grand_total, status_pembayaran, nama_konsumen, no_hp, tanggal_masuk, tanggal_selesai, deskripsi, gambar_before, dibayar, kembalian')
            ->orderBy('tgl_jual', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `no_faktur`, `tgl_jual`, `grand_total`, `status_pembayaran`, `nama_konsumen`, `no_hp`, `tanggal_masuk`, `tanggal_selesai`, `deskripsi`, `gambar_before`, `dibayar`, `kembalian`
FROM `tbl_jual`
ORDER BY `tgl_jual` DESC

    public function UpdateStatusPesanan($noFaktur, $status)
    {
        return $this->db->table('tbl_jual')
            ->where('no_faktur', $noFaktur)
            ->update(['status_pembayaran' => $status]);
---
UPDATE `tbl_jual` SET `status_pembayaran` = 'pending'
WHERE `no_faktur` = '202504130002'

    public function UpdateStatusPembayaran($noFaktur, $statusPembayaran)
    {
        return $this->db->table('tbl_jual')
            ->where('no_faktur', $noFaktur)
            ->update(['status_pembayaran' => $statusPembayaran]);
---
UPDATE `tbl_jual` SET `status_pembayaran` = 'pending'
WHERE `no_faktur` = '6543'

    public function CariPesanan($keyword)
    {
        if (empty($keyword)) {
            return $this->GetPesananTerbaru(); // Return semua data jika tidak ada keyword
        }

        return $this->db->table('tbl_jual')
            ->select('no_faktur, tgl_jual, grand_total, status_pembayaran,
                      nama_konsumen, no_hp, tanggal_masuk, tanggal_selesai, deskripsi, dibayar, kembalian')
            ->groupStart()
            ->like('no_faktur', $keyword)
            ->orLike('nama_konsumen', $keyword)
            ->orLike('no_hp', $keyword)
            ->orLike('deskripsi', $keyword)
            ->groupEnd()
            ->orderBy('tgl_jual', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `no_faktur`, `tgl_jual`, `grand_total`, `status_pembayaran`, `nama_konsumen`, `no_hp`, `tanggal_masuk`, `tanggal_selesai`, `deskripsi`, `dibayar`, `kembalian`
FROM `tbl_jual`
WHERE   (
`no_faktur` LIKE '%6543%' ESCAPE '!'
OR  `nama_konsumen` LIKE '%6543%' ESCAPE '!'
OR  `no_hp` LIKE '%6543%' ESCAPE '!'
OR  `deskripsi` LIKE '%6543%' ESCAPE '!'
 )
ORDER BY `tgl_jual` DESC