app/Models/ModelKategori.php

SELECT *
FROM `tbl_kategori`
---
    public function AllData(){
        return $this->db->table('tbl_kategori')
        ->get()
        ->getResultArray();