app/Models/ModelLaporan.php

    public function DataTahunan($tahun)
    {
        return $this->db->table('tbl_rinci_jual')
            ->join('tbl_jual', 'tbl_jual.no_faktur = tbl_rinci_jual.no_faktur')
            ->where('year(tbl_jual.tgl_jual)', $tahun)
            ->select('month(tbl_jual.tgl_jual) as bulan')
            ->groupBy('month(tbl_jual.tgl_jual)')
            ->selectSum('tbl_rinci_jual.total_harga')
            ->selectSum('tbl_rinci_jual.untung')
            ->get()
            ->getResultArray();
---
SELECT `tbl_jual`.`tgl_jual`, SUM(`tbl_rinci_jual`.`total_harga`) AS `total_harga`, SUM(`tbl_rinci_jual`.`untung`) AS `untung`
FROM `tbl_rinci_jual`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur` = `tbl_rinci_jual`.`no_faktur`
WHERE month(tbl_jual.tgl_jual) = '4'
AND year(tbl_jual.tgl_jual) = '2025'
GROUP BY `tbl_jual`.`tgl_jual`